---
type: CableTrayType
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 5
tags: [revit-api, class]
---

# CableTrayType

`Autodesk.Revit.DB.Electrical.CableTrayType` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | IsValidBendMultiplier | — | `public bool IsValidBendMultiplier ( double bendMultiplier )` |
| Property | BendMultiplier | — | `public double BendMultiplier { get ; set ; }` |
| Property | IsWithFitting | — | `public bool IsWithFitting { get ; }` |
| Property | Parameter | — | `` |
| Property | ShapeType | — | `public CableTrayShape ShapeType { get ; }` |